import "./MuseumInfo.css";
import { useEffect } from "react";
import { Link } from "react-router-dom";

const MuseumInfo: React.FC = () => {
  useEffect(() => {
    document.body.style.overflow = "hidden";

    return () => {
      document.body.style.overflow = "auto";
    };
  }, []);
  return (
    <div>
      <div className="background-info-image">
        <div className="text-box">
          <p>
            Το Μουσείο Αργυροτεχνίας βρίσκεται στο κάστρο των Ιωαννίνων, και
            συγκεκριμένα στο δυτικό προμαχώνα της νοτιανατολικής ακρόπολης (Ιτς
            Καλέ). Καταλαμβάνει τα δύο επίπεδα του προμαχώνα καθώς και το κτίσμα
            των παλαιών μαγειρείων που εφάπτεται σε αυτόν. Χρονικά, η έκθεση
            αναφέρεται κατά βάση στη μεταβυζαντινή περίοδο, από τον 15ο αιώνα
            και έπειτα, χωρίς ωστόσο να λείπουν και αναφορές στο απώτερο
            παρελθόν, καθώς η τεχνολογία που χρησιμοποιείται για την παραγωγή
            των ασημικών ανάγεται συχνά σε πολύ παλαιότερες περιόδους.
          </p>
        </div>
        <div className="text-box-secondary">
          <p>
            Σκοπός του είναι η διάσωση της γνώσης για την ηπειρώτικη
            αργυροτεχνία και η διάχυση της πληροφορίας γύρω από την τεχνολογία
            της στο ευρύ κοινό. Επίσης, η σύνδεση αυτής της τεχνολογίας με τα
            κοινωνικά δεδομένα της εποχής γύρω από τα οποία αυτή αναπτύχθηκε και
            άκμασε. Πρόκειται για μουσείο θεματικό, αφού πραγματεύεται την
            τεχνολογία της αργυροχοΐας κατά την προβιομηχανική περίοδο, αλλά
            ταυτόχρονα και μουσείο περιφερειακό, αφού εστιάζει κυρίως στην
            ιστορία της αργυροχοΐας στην περιοχή της Ηπείρου.
          </p>
        </div>
        <div className="info-return-button">
          <Link to="/" style={{ textDecoration: "none" }}>
            <div className="info-return-button-text">← Return To Homepage</div>
          </Link>
        </div>
      </div>
    </div>
  );
};

export default MuseumInfo;
